test/jmeter/performance/restore_dashboards.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.2">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Get Restore Dashboard Test Plan" enabled="true">
      <stringProp name="TestPlan.comments">This test executes the get dashboards request. </stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="SimpleConfigGui" testclass="ConfigTestElement" testname="Instructions" enabled="true">
        <stringProp name="TestPlan.comments">To run these tests:
1. Ensure your security plugin knows about your test users.  There is a users.propeties file under test/load/jmeter for this. If running from a bundle, 
    place it in tomcat&apos;s lib directory (overriding any existing file).
2. Inspect the &apos;Test Variables&apos; node for test parameters; number of users, number of repetitions, etc.
    Pay attention here to where your server is hosted, and where CAS (required) is hosted; these may be the same
3. Examine HTTP Request Defaults for the protocol, hostname, and port of your test server; this gets pre-pended on 
    every HTTP request sent during the tests
4. [Optional] Disable portions of the test by selecting nodes and right-clicking
5. [Optional] For readability, collapse all Thread Groups (User Threads, Admin Threads, etc.) 
6. [Optional] Select the &apos;View Results Tree&apos; or &apos;Aggregate Report&apos; results at the bottom of test
7. Clear previous run results using Run-&gt;Clear All, or the double broom button
8. Execute using menu choice Run-&gt;Start , or the Play button

**To run from the command line and override the properties in Test Variables, see the comment in Test Variables.</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Test Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="loopsPerUser" elementType="Argument">
            <stringProp name="Argument.name">loopsPerUser</stringProp>
            <stringProp name="Argument.value">${__P(loopsPerUser, 10)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numUsers" elementType="Argument">
            <stringProp name="Argument.name">numUsers</stringProp>
            <stringProp name="Argument.value">${__P(numUsers, 100)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Should be 500 or less to ensure successful login.</stringProp>
          </elementProp>
          <elementProp name="threadTimeToFail" elementType="Argument">
            <stringProp name="Argument.name">threadTimeToFail</stringProp>
            <stringProp name="Argument.value">${__P(threadTimeToFail, 1200)}</stringProp>
            <stringProp name="Argument.desc">The amount of time in milliseconds to put into the duration assertion of each thread. If the thread takes longer, it will fail.</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="approxTimePerRequest" elementType="Argument">
            <stringProp name="Argument.name">approxTimePerRequest</stringProp>
            <stringProp name="Argument.value">${__P(approxTimePerRequest, 300)}</stringProp>
            <stringProp name="Argument.desc">Approximate amount to time to allow each request, used in Gaussian Timer.</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="versionTesting" elementType="Argument">
            <stringProp name="Argument.name">versionTesting</stringProp>
            <stringProp name="Argument.value">${__P(versionTesting, 5.0.0-ALPHA-SPRINT2-v1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="hostName" elementType="Argument">
            <stringProp name="Argument.name">hostName</stringProp>
            <stringProp name="Argument.value">${__P(hostName, perfowfapp01.goss.owfgoss.org)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">OWF Perf server: perfowfapp01.goss.owfgoss.org</stringProp>
          </elementProp>
          <elementProp name="hostPort" elementType="Argument">
            <stringProp name="Argument.name">hostPort</stringProp>
            <stringProp name="Argument.value">${__P(hostPort, 8443)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="casHost" elementType="Argument">
            <stringProp name="Argument.name">casHost</stringProp>
            <stringProp name="Argument.value">${__P(casHost, perfowfapp01.goss.owfgoss.org)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">OWF Perf server: perfowfapp01.goss.owfgoss.org</stringProp>
          </elementProp>
          <elementProp name="casPort" elementType="Argument">
            <stringProp name="Argument.name">casPort</stringProp>
            <stringProp name="Argument.value">${__P(casPort, 8443)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="debugEnabled" elementType="Argument">
            <stringProp name="Argument.name">debugEnabled</stringProp>
            <stringProp name="Argument.value">${__P(debugEnabled, false)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="resultsFileBase" elementType="Argument">
            <stringProp name="Argument.name">resultsFileBase</stringProp>
            <stringProp name="Argument.value">~/${__P(resultsDir,test-reports/jtl)}/${__javaScript(&apos;${__TestPlanName()}&apos;.replace(&apos;.jmx&apos;\, &apos;&apos;))}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
        <stringProp name="TestPlan.comments">To override these in the command line use the format -J[variableName]=value.

If they are not set via the command line, they will use their default value which is the second parameter, following the variable name.

Command line example:
jmeter -n -t perf_get_dashboards.jmx -l results.txt -JloopsPerUser=3 -JapproxTimePerRequest=500 -JnumUser=100 -JthreadTimeToFail=1000</stringProp>
      </Arguments>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${hostName}</stringProp>
        <stringProp name="HTTPSampler.port">${hostPort}</stringProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">4</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <AuthManager guiclass="AuthPanel" testclass="AuthManager" testname="HTTP Authorization Manager" enabled="true">
        <collectionProp name="AuthManager.auth_list">
          <elementProp name="" elementType="Authorization">
            <stringProp name="Authorization.username">${userName}</stringProp>
            <stringProp name="Authorization.password">password</stringProp>
          </elementProp>
        </collectionProp>
      </AuthManager>
      <hashTree/>
      <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
        <collectionProp name="CookieManager.cookies"/>
        <boolProp name="CookieManager.clearEachIteration">false</boolProp>
        <stringProp name="CookieManager.policy">rfc2109</stringProp>
      </CookieManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="User Threads" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${numUsers}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <longProp name="ThreadGroup.start_time">1290786324000</longProp>
        <longProp name="ThreadGroup.end_time">1290786324000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="TestPlan.comments">Ramp-Up set to 0 because the Login scripts handle their throughput automatically.</stringProp>
      </ThreadGroup>
      <hashTree>
        <UserParameters guiclass="UserParametersGui" testclass="UserParameters" testname="User Parameters" enabled="true">
          <collectionProp name="UserParameters.names">
            <stringProp name="-266534175">userRole</stringProp>
          </collectionProp>
          <collectionProp name="UserParameters.thread_values">
            <collectionProp name="115842275">
              <stringProp name="2645995">User</stringProp>
            </collectionProp>
          </collectionProp>
          <boolProp name="UserParameters.per_iteration">false</boolProp>
          <stringProp name="TestPlan.comments">Sets parameters specific to a User thread (as opposed to an Admin thread).

Variable Explanations:
1. userRole: Tells the login script what type of usernames to generate. (e.g. testUser1 or testAdmin1)</stringProp>
        </UserParameters>
        <hashTree/>
        <OnceOnlyController guiclass="OnceOnlyControllerGui" testclass="OnceOnlyController" testname="Login" enabled="true"/>
        <hashTree>
          <IncludeController guiclass="IncludeControllerGui" testclass="IncludeController" testname="Include Login Script" enabled="true">
            <stringProp name="TestPlan.comments">Includes fragments/login.jmx, which handles the actual login for each user.</stringProp>
            <stringProp name="IncludeController.includepath">fragments/login.jmx</stringProp>
          </IncludeController>
          <hashTree/>
        </hashTree>
        <OnceOnlyController guiclass="OnceOnlyControllerGui" testclass="OnceOnlyController" testname="Synchronize Users" enabled="true"/>
        <hashTree>
          <TestAction guiclass="TestActionGui" testclass="TestAction" testname="Test Action" enabled="true">
            <intProp name="ActionProcessor.action">1</intProp>
            <intProp name="ActionProcessor.target">0</intProp>
            <stringProp name="ActionProcessor.duration">0</stringProp>
          </TestAction>
          <hashTree/>
          <SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer" testname="Synchronizing Timer" enabled="true">
            <stringProp name="groupSize">${__V(num${userRole}s)}</stringProp>
          </SyncTimer>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="List Dashboards" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">owf/dashboard/</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">Java</stringProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-547797305">&quot;success&quot;:true</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <BSFPostProcessor guiclass="TestBeanGUI" testclass="BSFPostProcessor" testname="BSF PostProcessor - Parse Group Dashoard Ids" enabled="true">
            <stringProp name="script">// Turn the JSON into an object called &apos;json&apos;
var json =  eval(&apos;(&apos; + prev.getResponseDataAsString() + &apos;)&apos;);

log.info(&apos;json data:&apos;+prev.getResponseDataAsString());

//Iterate through the JSON object and create JMeter Variables for later use
var groupDashboardIdsLength = 0;
for (var i = 0, len = json.data.length; i &lt; len; i++) {
    var record = json.data[i];
    if (record.groups.length &gt; 0 ) {
     //save id
    groupDashboardIdsLength++;
    log.info(&quot;groupDashboardIds&quot; + &quot;_&quot; + (groupDashboardIdsLength) + &quot;:&quot;+record.guid );
    vars.put(&quot;groupDashboardIds&quot; + &quot;_&quot; + (groupDashboardIdsLength), record.guid);
    }
}

log.info(&apos;groupDashboardIdsLength:&apos;+groupDashboardIdsLength);
vars.put(&quot;groupDashboardIdsLength&quot;,groupDashboardIdsLength);
</stringProp>
            <stringProp name="scriptLanguage">javascript</stringProp>
          </BSFPostProcessor>
          <hashTree/>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
            <stringProp name="ConstantTimer.delay">${__jexl2(${__threadNum()} * 400)}</stringProp>
          </ConstantTimer>
          <hashTree/>
        </hashTree>
        <OnceOnlyController guiclass="OnceOnlyControllerGui" testclass="OnceOnlyController" testname="Synchronize Users" enabled="true"/>
        <hashTree>
          <TestAction guiclass="TestActionGui" testclass="TestAction" testname="Test Action" enabled="true">
            <intProp name="ActionProcessor.action">1</intProp>
            <intProp name="ActionProcessor.target">0</intProp>
            <stringProp name="ActionProcessor.duration">0</stringProp>
          </TestAction>
          <hashTree/>
          <SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer" testname="Synchronizing Timer" enabled="true">
            <stringProp name="groupSize">${__V(num${userRole}s)}</stringProp>
          </SyncTimer>
          <hashTree/>
        </hashTree>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Restore Dashboards Loop" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">${loopsPerUser}</stringProp>
        </LoopController>
        <hashTree>
          <UserParameters guiclass="UserParametersGui" testclass="UserParameters" testname="User Parameters" enabled="true">
            <collectionProp name="UserParameters.names">
              <stringProp name="-1194161410">groupDashboardGuid</stringProp>
            </collectionProp>
            <collectionProp name="UserParameters.thread_values">
              <collectionProp name="549397681">
                <stringProp name="-1562477009">${__V(groupDashboardIds_${__Random(1, ${groupDashboardIdsLength})})}</stringProp>
              </collectionProp>
            </collectionProp>
            <boolProp name="UserParameters.per_iteration">false</boolProp>
          </UserParameters>
          <hashTree/>
          <IncludeController guiclass="IncludeControllerGui" testclass="IncludeController" testname="Include Restore Dashboards Fragment" enabled="true">
            <stringProp name="IncludeController.includepath">./components/user/restore_dashboards.jmx</stringProp>
          </IncludeController>
          <hashTree/>
          <GaussianRandomTimer guiclass="GaussianRandomTimerGui" testclass="GaussianRandomTimer" testname="Gaussian Random Timer" enabled="true">
            <stringProp name="ConstantTimer.delay">0</stringProp>
            <stringProp name="RandomTimer.range">${__jexl2(${numUsers} * ${approxTimePerRequest})}</stringProp>
          </GaussianRandomTimer>
          <hashTree/>
          <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">${resultsFileBase}-user_restore_dashboards.jtl</stringProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <OnceOnlyController guiclass="OnceOnlyControllerGui" testclass="OnceOnlyController" testname="Logout" enabled="true"/>
        <hashTree>
          <SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer" testname="Synchronizing Timer" enabled="true">
            <stringProp name="groupSize">${__V(num${userRole}s)}</stringProp>
          </SyncTimer>
          <hashTree/>
          <IncludeController guiclass="IncludeControllerGui" testclass="IncludeController" testname="Include Logout Script" enabled="true">
            <stringProp name="TestPlan.comments">Includes fragments/logout.jmx, which handles the logout of each user.</stringProp>
            <stringProp name="IncludeController.includepath">fragments/logout.jmx</stringProp>
          </IncludeController>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>